/*
// Import the functions you need from the SDKs you need
import { initializeApp } from "firebase/app";
import { getAnalytics } from "firebase/analytics";
// TODO: Add SDKs for Firebase products that you want to use
// https://firebase.google.com/docs/web/setup#available-libraries

// Your web app's Firebase configuration
// For Firebase JS SDK v7.20.0 and later, measurementId is optional
const firebaseConfig = {
  apiKey: "AIzaSyCWnytGGLUXcUUj82bo8HHI1ZyQhZAuTrk",
  authDomain: "podcast-question-e9495.firebaseapp.com",
  databaseURL: "https://podcast-question-e9495-default-rtdb.firebaseio.com",
  projectId: "podcast-question-e9495",
  storageBucket: "podcast-question-e9495.appspot.com",
  messagingSenderId: "738455935178",
  appId: "1:738455935178:web:0183db64d06c90f90d7c33",
  measurementId: "G-ZCTJZRZTMT"
};

// Initialize Firebase
const app = initializeApp(firebaseConfig);
const analytics = getAnalytics(app);
*/

export const lessonArray = [
	{
		id: 'biology',
		title: 'Биология',
		introdaction: `Биология аз калимаи юнони гирифта шуда "bio" ҳаёт ва "logos" илм мебошад, яъне илм дар бораи табиат мебошад`,
		literatures: [
			'"Campbell Biology" (11-е издание) - Нил Кэмпбелл',
			'"Essential Cell Biology" - Брюс Альбертс',
			'Molecular Biology of the Cell" - также Брюс Альбертс',
			'"Must Know High School Biology" - Келли Плоегер Кокс',
			'"Biology: Life on Earth with Physiology" - Джеральд Аудесирк',
		],
		lessons: [
			{
				title: 'Системаи асаб',
				theory: `<b>Аҳамияти системаи асаб.</b> Системаи асаб дар танзими
				ва- зифаи организм нақши муҳим мебозад. Вай кори доимии
				ҳуҷайраҳо, бофтаҳо, узвҳо ва низоми онҳоро таъмин мекунад.
				Бо мавҷудияти ин низом организм ба муҳити беруна алоқаманд
				аст. Фаъолияти системаи асаб ба ҳиссиёт, таълим, хотира,
				нутқ, тафаккур ва равандҳои руҳи асос ёфта, одам бо ёрии
				онҳо на танҳо муҳити атрофро дарк мекунад, балки метавонад
				онро фаъолона дигаргун созад. <br />
				<b>Бофтаи асаб.</b> Системаи асабро ҳуҷайраҳое ташкил
				мекунанд, ки нейрон ва ҳуҷайраҳои асосии бофтаи асаб буда,
				кори системаи асабро таъмин мекунанд. ҳуҷайраҳои ҳамроҳ
				вазифаи ғизодиҳи, такягоҳи ва муҳофизатиро иҷро мекунанд.
				Миқдори ҳуҷайраҳои ҳамроҳ назар ба нейронҳо қариб 10
				маротиба зиёдтар мебошад. Нейрон аз се қисм иборат аст: 1)
				тана; 2) изофаи кутоҳ (дендритҳо); 3) изофаи дароз (ё
				аксон) (расми 9). Дендритҳо кутоҳ ва сершохаанд. Дар як
				нейрон метавонад якчанд дендрит мавҷуд бошад. Дендритҳо бо
				ретсепторҳо пайваст буда, импулсҳои асабиро ба ҷасади
				нейрон мебаранд ва вазифаи ҳиссиётқабулкуниро иҷро
				мекунанд. Аксон (шоха) бо мушакҳо пайваст шуда, вазифаи
				ҳаракатро иҷро мекунад. <br />Аз ҷиҳати шохарони нейронҳо
				се хел мешаванд: <br>
				<ol>
				  <li> Нейронҳои якшоха (униполяри);</li>
				  <li> Нейронҳои душоха (биполяри);</li>
				  <li> Нейронҳои бисёршоха
					 (мултиполяри) (расми 10).</li>
				</ol>
				  Торҳои асаб ба тамоми организм
				паҳн шуда, импулсҳоро ба ҳамаи узвҳои бадан мебаранд. <br>
				<b>Қисмҳои системаи асаб.</b> Системаи асаб аз қисмҳои маркази ва
				канори иборат аст.  қисми маркази аз мағзи сар ва ҳароммағз
				таркиб ёфта, бо лимфаи бофтаи васлкунанда пушонида
				шудааст. Ба қисми канори гиреҳҳои асаб дохил ме- шаванд
				(расми 11). Як қисми системаи асаб, ки кори мушакҳои
				скелетро танзим мекунад, системаи соматики ном дорад. Одам
				тавассути ин системаи асаб метавонад ҳаракатҳоро идора
				карда, онҳоро ихтиёран ба вуҷуд орад ё қатъ гардонад.`,
				video: [
					'https://youtu.be/NwEYaKQe-BY?si=wD4Zacqnn0M56AY0',
					'https://youtu.be/xqDy_MRNasw?si=ByJ2n85z1uB37PnG',
				],
				test: [
					{
						question: ' Бофтаҳои асаб аз кадом қисмҳо иборатанд?',
						answers: [
							{ id: true, test: 'Тана, изофаҳои дароз ва кутоҳ' },
							{ id: false, test: 'Тана ва изофа' },
							{ id: false, test: ' Тана, сар ва нуг' },
						],
					},
					{
						question:
							'Хун дар организм ҳаракат намуда кадом вазифаро иҷро менамояд?',
						answers: [
							{ id: false, test: 'Хабари' },
							{ id: true, test: 'Нақлиёти' },
							{ id: false, test: 'Огоҳи' },
						],
					},
				],
				task: 'Рефлекс чист?',
			},
			{
				title: 'Мубодилаи неру. Гигиенаи хурок',
				theory: `Барои равандҳои
				гуногуни фаъолияти ҳаётии организм (ба вуҷуд омадани
				моддаҳо, кори мушакҳо, нигоҳдории ҳарорати бадан) дар
				як шабонаруз қариб 10500 кҷ (2500 ккал) энергия (неру)
				зарур аст. Манбаи он неруест, ки дар бандҳои кимиёвии
				молекулаҳои моддаҳои узви (сафеда, чарб, карбогидрат)
				мавҷуд аст ва аз хурок гирифта мешавад.
				133
				Дар организм мунтазам раванди мураккаби мубодилаи
				неруи ба амал меояд. Дар натиҷаи баъзе мубодилаҳо организм
				аз неру бой шуда, дар дигар мубодила онро талаф медиҳад.
				Чунончи, ҳангоми оксидшави ва таҷзияи глюкоза, инчунин
				дигар пайвастаҳои узви дар ҳуҷайраҳо неруи кимиёви озод
				шуда, ба неруи барқи ва механики табдил меёбад.
				Масалан, неруи барқии импулси асаб ба торҳои асаб
				додани ахборро таъмин карда, неруи механики кашишхурии
				мушакҳои скелет, мушакҳои дилу диафрагмаро таъмин
				мекунад. ҳамаи ин намудҳои неру ба неруи гарми табдил
				меёбанд. Як қисми гарми барои мунтазам нигоҳ доштани
				ҳарорати бадан истифода мегардад ва зиёдатии онро
				организм ба муҳити атроф ихроҷ мекунад.
				ҳамин тариқ, организми одам ба қонуни бақои неру
				итоат мекунад. Неру пайдо ва нест намешавад, он танҳо
				тағйир меёбад.<br>
				<b>Сарф кардани неру дар корҳои гуногун.</b> Неруи организм
				сарфакардаро хурок пурра месозад. Миқдори неруи дар як
				шабонаруз сарфкардаи одамони касбу корашон гуногунро
				дониста, барояшон меъёри хурок муқаррар намудан лозим
				аст.
				Муайян шудааст, ки одами ба меҳнати ҷисмони
				машғулбуда зиёдтар неру сарф мекунад. ҷадвали 1-ро аз
				назар гузаронед.`,
				video: ['video/', 'video/'],
				test: [
					{
						question: 'Одам чанд дандони калони курси дорад?',
						answers: [
							{ id: false, test: '4-то' },
							{ id: true, test: '6-то' },
							{ id: false, test: '8-то' },
						],
					},
					{
						question: 'Глюкозаро кадом ғадуд танзим мекунад?',
						answers: [
							{ id: false, test: 'ҷоғар' },
							{ id: false, test: 'Оби даҳон.' },
							{ id: true, test: 'Зери меъда' },
						],
					},
				],
				task: 'Ғадуди сипаршакл дар мубодилаи моддаҳо чи нақшеро мебозад?',
			},
		],
	},

	{
		id: 'english',
		title: 'З. англиси',
		introdaction: `Аз сабабе, ин забон аст барои аз худ кардани он ман ба шумо тавсия медиҳам
		ба ғайр аз хондан боз бояд бо он муошират кард. Барои ин шумо бояд ё шахсеро ёбед, ки бо ин забон муошират мекунад 
		ё инки филмҳоро бо забони хориҷи тамошо кунед ва мусиқиҳои хориҷиро гуш кунед`,
		literatures: [
			'Practical English Usage',
			'Notes From a Small Island ',
			'Everything I know about Love',
		],
		lessons: [
			{
				title: 'Граматика',
				theory: `
				Грамматикаи забони англисӣ омӯзиши ҷанбаҳои гуногунро дар бар мегирад, аз қабили замони феъл,
				 сохтори ҷумла, қисмҳои нутқ, истифодаи дурусти мақолаҳо, пешвандҳо, пайвандакҳо ва ғайра.
				 Инҳоянд чанд маслиҳат оид ба омӯзиши самараноки грамматикаи англисӣ ва такмил додани малакаҳои гуфтугӯии шумо:


				 <h2 class="sub-title">
				 	Омӯзиши грамматика:
				 
				 </h2>
				 <ul class="real-list">

				 <li>
					 Асосҳо: Аз асосҳо оғоз кунед - қисмҳои нутқ, истифодаи дурусти замонҳо ва сохтори ҷумларо омӯзед.
				 </li>
				 <li>
					Машқ кунед: Барои мустаҳкам кардани чизҳои омӯхтаатон мунтазам машқҳои грамматикиро иҷро кунед.
				 </li>
				 <li>
					Қоидаҳо ва истисноҳо: Қоидаҳои асосии грамматика ва истисноҳои онҳоро дар хотир доред.
				 </li>
				 <li>
					 Истифодаи захираҳо: Истифодаи маълумотномаҳои грамматикӣ, китобҳои дарсӣ ва захираҳои интернетӣ.
				 </li>
				 <li>
				  Муносибати тадриҷан: кӯшиш накунед, ки ҳама грамматикаро якбора аз худ кунед. Омӯзиш аз рӯи мавзӯъ.
				 </li>
				 </ul>


				 <h2 class="sub-title">Баланд бардоштани малакаҳои нутқ:</h2>

				 <ul class="real-list">
					<li>
						Таҷрибаи суханронӣ: Бе тарс аз хато кардан мунтазам бо забони англисӣ сухан гӯед.
					</li>
					<li>
						Вохӯриҳои забонӣ: Ба маҳфилҳои забономӯзӣ ё вохӯриҳо ҳамроҳ шавед, ки дар он шумо метавонед бо забони англисӣ бо забони модарӣ ё дигар донишҷӯён машқ кунед.
					</li>
					<li>
						Истифодаи технология: Аз барномаҳо ва барномаҳои омӯзиши забон, ки таҷрибаи гуфтугӯро пешниҳод мекунанд, истифода баред.
					</li>
					<li>
						Тамошои филмҳо ва гӯш кардани мусиқӣ: Филмҳо тамошо кунед ва мусиқӣ ба забони англисӣ гӯш кунед, то фаҳмиш ва талаффузи худро беҳтар созед.
					</li>
					<li>
						Таъмид ба забон: Агар имконпазир бошад, худро дар муҳити инглисзабон ғарқ кунед, ки дар он шумо бояд пайваста ин забонро истифода баред.
					</li>
					<li>
						Ибора ва фразеологизмҳоро омӯзед: Ибораҳо ва идиомаҳои муфидро омӯзед, ки аксар вақт дар нутқи ҳамарӯза истифода мешаванд.
					</li>
					<li>
						Худро сабт кунед: Сухани худро сабт кунед ва онро таҳлил кунед, то хатогиҳоро муайян ва ислоҳ кунед.
					</li>
				 </ul>
					
					
					Маслиҳатҳои умумӣ:
					<br>- Мунтазамӣ: Таҷрибаи ҳаррӯза барои таҳкими дониш ва малакаҳо муҳим аст.
					<br>- Сабр ва истодагарӣ: Натиҷаҳои фаврӣ интизор нашавед, омӯзиши забон вақтро мегирад.
					<br>- Омӯзиши интерактивӣ: Аз усулҳои интерактивии омӯзиш, аз қабили бозиҳои забонӣ ва курсҳои онлайн истифода баред.
					<br>- Алоқа: Аз забони модарӣ ё муаллимон фикру мулоҳиза гиред ва дар бораи камбудиҳои худ кор кунед.<br><br>

					Дар хотир доред, ки калиди омӯзиши муваффақонаи забон омезиши донишҳои назариявӣ ва татбиқи амалӣ мебошад.<br><br>

`,
				video: [
					'https://youtu.be/2To6EqvVPYo?si=I2cVW5hLeiOi6Sg0',
					'https://youtu.be/AvjlXszw8A0?si=N09mmKdvYc-654CQ',
				],
				test: [
					{
						question: ' Шакли комили феъли "рафтан" кадом аст?',
						answers: [
							{ id: true, test: 'had gone' },
							{ id: false, test: 'went' },
							{ id: false, test: 'has gone' },
							{ id: false, test: 'will have gone' },
						],
					},
					{
						question:
							'Шакли бавоситаи нутқи ҷумларо дуруст интихоб кунед: «Ман китоб мехонам», гуфт ӯ.',
						answers: [
							{ id: false, test: 'He said he is reading a book' },
							{ id: true, test: 'He said he was reading a book.' },
							{ id: false, test: 'He said he reads a book' },
							{ id: false, test: ' He said he read a book.' },
						],
					},
					{
						question: 'Маънои калимаи "ҳамаҷоя" чист?',
						answers: [
							{ id: false, test: 'Rare' },
							{ id: true, test: 'Omnipresent' },
							{ id: false, test: 'Unique' },
							{ id: false, test: 'Ancient' },
						],
					},
				],
				task: `
				1. Дар мавзӯи «Таъсири шабакаҳои иҷтимоӣ ба муоширати муосир иншо нависед, ҷанбаҳои мусбат ва манфиро муҳокима кунед. <br>
				2. Шеъри Роберт Фрост «Роҳ тай нашудааст»-ро таҳлил кунед ва мавзӯи интихобро дар ҳаёти инсон баррасӣ кунед.  <br>
				3. Подкастро бо забони англисӣ дар бораи навовариҳои технологӣ гӯш кунед ва хулосаи мухтасар нависед. <br>
				4. Дар мавзуи «Оё тахсил барои хама бепул бошад?» мубохиса гузаронед. ва далелҳои тарафдор ва муқобил омода кунед.
				`,
			},
		],
	},

	{
		id: 'information',
		title: 'Т. иттилооти',
		introdaction: `"Информатика омӯзиши компютерҳо нест, бештар аз астрономия омӯзиши телескопҳо аст. Ин на танҳо технология, балки қудратест, ки дари ҷаҳони имконотро мекушояд."	`,
		literatures: [
			'Учебники и программы "Кумир" - хороший комплект для обучения информатике.',
			'"Информатика. 10-11 классы" - авторы К. Ю. Поляков, Е. А. Еремин.',
			'"Грокаем алгоритмы" - Б. Адитья, доступное введение в алгоритмы и структуры данных.',
			'"Изучаем C#" - Э. Гриффитс, подходит для тех, кто хочет научиться программировать на C#.',
			'"Программирование: вводный курс" - Д. Шапиро, подходит для начинающих изучать основы программирования.',
		],
		lessons: [
			{
				title: 'Тафакури сунъи',
				theory: `
				<h2 class='sub-title'>Интеллекти сунъӣ: оянда дар ин ҷост!</h2>

				Салом, муҳаққиқони ҷавон! Имрӯз мо ба саёҳати ҳаяҷоновар ба ҷаҳони зеҳни сунъӣ (AI), ки ҷаҳони моро босуръат
				тағйир медиҳад ва барои мо имкониятҳои беохир мекушояд, меравем.

				<br>

				
				<b>AI чист?</b>

				Ёрдамчии бениҳоят доноеро тасаввур кунед, ки метавонад мушкилотро ҳал кунад, аз хатогиҳои худ биомӯзад, забонро фаҳмад ва ҳатто эҷодкорӣ эҷод кунад. Ин AI аст!

				<br>

				<b>AI чӣ гуна кор мекунад?</b>

				 
				«Мағзи сар» AI аз алгоритмҳое иборат аст, ки метавонанд иттилоотро коркард кунанд. Вай хар кадар бештар маълумот гирад, хамон кадар бехтар меомузад ва проблемахои мураккабтарро хал карда метавонад.

				<br>
				<b>Мо аллакай бо AI дар куҷо вомехӯрем?</b>
				
				AI аллакай дар ҳама ҷо аст! Он ба духтурон барои ташхис, муҳандисон дар тарҳрезии технологияҳои нав ва ба деҳқонон дар парвариши ҳосили бештар кӯмак мекунад. AI дар телефонҳои мо, баландгӯякҳо, мошинҳо ва ҳатто бозиҳои компютерӣ истифода мешавад.
				
				<br>

				<b>Чаро AI муҳим аст?</b>

 				AI метавонад бисёр мушкилотеро, ки имрӯз мо дучор мешавем, ҳал кунад. Он метавонад ба мо дар мубориза бо бемориҳо, беҳтар кардани таҳсил ва бехатар ва самараноктар кардани нақлиёт кӯмак кунад.
				
				<br>
				
				<b>АI оянда аст!</b>

				
				АI бо суръат пеш меравад ва дар оянда дар хаёти мо роли боз хам калонтар мебозад.

				<br>

				<b>Шумо чӣ кор карда метавонед? </b>Омӯзиши AI калиди ояндаи дурахшон аст!
				
				 
				
				<br>
				

				<ul class='real-list'>
					<li>Оғози хурд: Дар бораи AI маълумоти бештар гиред, мақолаҳо хонед, видеоҳоро тамошо кунед.</li>
					<li>Маҳоратҳоро инкишоф диҳед: барномасозӣ, мантиқ, математикаро омӯзед.</li>
					<li>Эҷодкор бошед: идеяҳо дар бораи он, ки чӣ гуна AI барои ҳалли мушкилот истифода мешавад, пешниҳод кунед.</li>
					<li>Аз кӯшиши чизҳои нав натарсед: AI як соҳаи доимо инкишофёбанда аст, аз ин рӯ ҳамеша чизи наве барои омӯхтан вуҷуд дорад.</li>
				</ul>


				Дар хотир доред, ки оянда аз они онҳое аст, ки чӣ гуна эҷод кардан ва фикр карданро медонанд. AI воситаи шумост, ки ба шумо ҷаҳонро беҳтар тағйир медиҳад!
				<br>
				
				<b>Дар хотир доред:</b>
				<ul class='real-list'>
				<li>AI ҷоду нест, балки натиҷаи меҳнати сахт ва ғояҳои оқилона аст.</li>
				<li>AI метавонад ҳам барои хуб ва ҳам бад истифода шавад.</li>
				<li>Муҳим аст, ки AI мувофиқи принсипҳои ахлоқӣ таҳия карда шавад.</li>
				<li>Ояндаи AI аз шумо вобаста аст!</li>
				</ul>

				<br>
				
				
				
				
				
				АИ на танхо мачмуи технологияхо, балки калиди имкониятхо ва кашфиёти нав мебошад.
				Ба саёҳати ҳаяҷонбахш ба ҷаҳони АИ оғоз кунед ва созандагони оянда шавед!
				
				

				`,
				video: [
					'https://youtu.be/iVQUE4D3IeE?si=lWo0FAX-B_uKWMBm',
					'https://youtu.be/aeGi6lqzdck?si=on9yzo8Jfn5v6uj2',
				],
				test: [
					{
						question: 'HTML чӣ маъно дорад?',
						answers: [
							{ id: false, test: 'Забони аломатгузории Hyper Trainer' },
							{ id: true, test: 'Забони аломатгузории гиперматн' },
							{
								id: false,
								test: 'Гиперпайвандҳо ва забони аломатгузории матн',
							},
							{ id: false, test: 'Забони мошинсозии технологияи оли' },
						],
					},
					{
						question: 'Кадоме аз инҳо забони барномасозӣ нест?',
						answers: [
							{ id: false, test: 'Python' },
							{ id: false, test: 'Java' },
							{ id: true, test: 'HTML' },
							{ id: false, test: 'C++' },
						],
					},
					{
						question:
							'Мақсади асосии системаи идоракунии пойгоҳи додаҳо (DBMS) чист?',
						answers: [
							{
								id: true,
								test: 'Идоракунии додаҳо ва ба корбарон имкон додани вазифаҳои гуногунро бо осонӣ иҷро кардан',
							},
							{ id: false, test: 'Сохтани вебсайтҳо ва барномаҳои веб' },
							{
								id: false,
								test: 'Барои коркарди шабака ва иртиботи байни компютерхо',
							},
							{ id: false, test: 'Тарҳрезии графикӣ ва интерфейси корбар' },
						],
					},
				],
				task: `
				1. Алгоритми ба навъбандии ҳубобӣ массиви ададҳо тартиб дода, бартарӣ ва нуқсонҳои онро шарҳ диҳед.
				<br>2. Сохтани вебсайти асосӣ бо истифода аз HTML ва CSS, ки матн, тасвирҳо ва ҷадвалҳоро дар бар мегирад.
				<br>3. Барномаи Python нависед, ки маълумотро аз файл мехонад ва омори истифодаи калимаҳоро дар матн нишон медиҳад.
				<br>4. Принсипҳои блокчейнро омӯзед ва барномаҳои эҳтимолии технологияро берун аз cryptocurrencies тавсиф кунед.`,
			},
			// {
			// 	title: 'Мафҳумҳои асосии пойгоҳи додаҳо',
			// 	theory: `Асоси системаи иттилоотии дилхоҳро пойгоҳи додаҳо ташкил медиҳад, ки дар он маълумот оид ба миқдори нусхаҳои зиёди синфҳои ба ҳам алоқаманди объектҳо нигоҳ дошта мешаванд. Зери мафҳуми пойгоҳи додаҳо маҷмўи ба тарзи хоса ташкилшудаи додаҳо фаҳмида мешавад, ки онҳо дар ягон барандаи модди нигоҳ дошта шудаанд. Бояд қайд намуд, ки ин маҷмўъ на ягон дастаи додаҳои пароканда, балки
			// 	155
			// 	дастаи додаҳои ба ҳам алоқаманди сохтори мебошад. Истифодабарандаи пойгоҳи додаҳо бояд ҳангоми корбари бо он оид ба ягон объект, ҳодиса ё раванд тасаввурот пайдо карда тавонад.
			// 	Пойгоҳи додаҳо пеш аз ҳама барои худкорсозии равандҳои захирасози, ҷустуҷўи, идоракуни ва лоиҳакаши пешбини шудааст. ҳар кадоми шумо аллакай борҳо бо пойгоҳи додаҳо сару кор гирифтаед. Масалан, китоби рақами телефонҳо, дафтарчаи ёддошт, феҳристи китобҳои китобхона, рўйхати дўстони дар телефони ҳамроҳ маҳфузбуда ва ғайра мисоли пойгоҳи додаҳоро ташкил медиҳанд. Дар дафтарчаи ёддошт иттилооти гуногун – ном, насаб, рақами телефон, суроға, санаи таваллуд ва дигар маълумотро доир ба дўстону наздикон нигоҳ доштан мумкин аст. Айнан ба мисли ҳамин дар феҳристи китобҳои китобхона иттилоот дар бораи номи китобҳо, муаллиф, соли барориш, нашриёт ва ғайра нигоҳ дошта мешавад. Агар дар дафтарчаи ёддошт додаҳо (ному насаб) аз рўйи алифбо нигоҳ дошта шаванд, дар феҳристи китобҳо онҳоро аз рўйи соҳаи фанни (мавзўи) мураттаб сохтан мумкин аст.<br>
			// 	<b>1. Пойгоҳи додаҳо – маҷмўи додаҳои сохтории соҳибном оид ба ягон соҳаи мавзўи.
			// 	<br>2. Пойгоҳи додаҳо – амсилаи иттилоотие, ки гурўҳи объектҳоро аз рўйи хосиятҳои якхелаашон муттаҳид месозад.</b><br>
			// 	Ба мафҳумҳои асосии пойгоҳи додаҳо майдон ва навишта дохил мешаванд. Майдон тавассути ном ва навъи додаҳо тавсиф дода мешавад. Дар ҷадвали дар мавзўи гузашта овардашуда Номи суруд, Иҷрочи, Жанр, Сол ва Мамлакат майдонҳои пойгоҳи додаҳои сурудҳо ба ҳисоб мераванд. Майдонҳои пойгоҳи додаҳо метавонанд дорои додаҳои навъи гуногун – матни, адади, санави, вақти, пули ва ғайра бошанд. Масалан, дар ҷадвали номбурда, ки дар он маълумот оид ба сурудҳо дарҷ гардидааст, номи майдонҳо дар сатри якум ва қиматҳои ҳар як майдон дар сутуни мувофиқи ҷадвал ба қайд гирифта шудааст.
			// 	<br><b>Майдон объекти одитарини пойгоҳи додаҳо буда, барои
			// 	нигаҳдории қиматҳои як параметри объекти воқеии
			// 	тасвиршаванда хизмат мерасонад.</b><br>
			// 	Азбаски дар пойгоҳи додаҳо оид ба параметрҳои зиёди объектҳои соҳаи мавзўи маълумот гирд оварда мешавад, бинобар он, ҷобаҷокунии (бақайдгирии) ин параметрҳо дар пойгоҳ масъалаи басо муҳим ба ҳисоб меравад. Масалан, агар маълумот оид ба ҳар як хонандаро дар намуди навишта тасвир намоем, ин мантиқан дуруст мебуд.
			// 	<br><b>Навишта – ин маҷмўи қиматҳои параметрҳои объекти
			// 	мушаххаси пойгоҳи додаҳо мебошад.</b><br>
			// 	156
			// 	Дар навишта тартиби ҷойгиршавии параметрҳо бояд чунин бошад: Насаб, Ном, Номи падар, Санаи таваллуд, Кўча, Хона, Манзил. Дар ин маврид доир ба ҳар як хонанда иттилооти заруриро зуд дастрас карда метавонем. Агар ин пайдарпайиро риоя накунем, он гоҳ ҷустуҷўи иттилооти зарури душвор мегардад. Барои муқоиса тартиби номуваффақи ҷойгиршавии ҳамин параметрҳоро дида мебароем: Хиёбони Рўдаки, Асозода, 19.03.2007, Хонаи 36/2, Мусо, ҳуҷраи 23, ҳабибулло. Тавре мебинем, дар пайдарпайи ҳатто ёфтани ному насаби хонанда низ бо душвори ба даст меояд.
			// 	ҳамин тариқ, марҳалаи муҳими сохтани пойгоҳи додаҳоро коркарди сохтори навиштаи он ташкил медиҳад.
			// 	<br><b>Сохтори навишта – ин маҷмўи мантиқан алоқаманди
			// 	майдонҳои пойгоҳи додаҳо мебошад, ки онҳо параметрҳои
			// 	объекти воқеиро тавсиф менамоянд.</b><br>
			// 	Агар иттилоот оид ба объект дар шакли ҷадвал тасвир ёфта бошад, он гоҳ сатри якуми он ҳамеша номгўи параметрҳоро дар бар мегирад, яъне вай сохтори навиштаро муайян мекунад. Тамоми сатрҳои боқимонда бошад, навиштаҳоро ифода менамоянд.`,
			// 	video: ['video/', 'video/'],
			// 	test: [
			// 		{
			// 			question: 'Одам чанд дандони калони курси дорад?',
			// 			answers: [
			// 				{ id: false, test: '4-то' },
			// 				{ id: true, test: '6-то' },
			// 				{ id: false, test: '8-то' },
			// 			],
			// 		},
			// 		{
			// 			question: 'Глюкозаро кадом ғадуд танзим мекунад?',
			// 			answers: [
			// 				{ id: false, test: 'ҷоғар' },
			// 				{ id: false, test: 'Оби даҳон.' },
			// 				{ id: true, test: 'Зери меъда' },
			// 			],
			// 		},
			// 	],
			// 	task: 'Зери мафҳуми «майдон» чи фаҳмида мешавад?',
			// },
		],
	},

	{
		id: 'geography',
		title: 'География',
		introdaction: `"Ҷуғрофия харитаи зинда ва нафасбахши ҷаҳон аст; он ба мо нишон медиҳад, ки мо дар куҷо будем ва ба куҷо рафта метавонем. Вай гузаштаи моро бо ояндаи мо мепайвандад."`,
		literatures: [
			'"Физическая география материков и океанов" в 2 томах, В. П. Максаковский.',
			'"Экономическая и социальная география мира. 10 класс."',
			'"География: Справочник для старшеклассников и поступающих в вузы" - Н. П. Неклюкова, И. В. Душина, Э. М. Раковская, А. П. Кузнецов, А. А. Лобжанидзе.',
			'"Мониторинг катастрофических изменений природной среды" - Мелкий, Лобищева.',
		],
		lessons: [
			{
				title: 'Тағйирёбии иқлим',
				theory: `
				Тағйирёбии иқлим ба экосистемаҳои ҷаҳонӣ ва ҷомеаҳои инсонӣ таъсири амиқ мерасонад. Инҳоянд нуктаҳои асосии ин мушкилот ва истинодҳо барои омӯзиши муфассал:
				<br><br>
				Ин чӣ маъно дорад:
				Тағйирёбии иқлим тағйироти дарозмуддат дар шакли обу ҳаво ва иқлимро дар бар мегирад. Ин метавонад ба шароити шадиди обу ҳаво, баланд шудани сатҳи баҳр, тағирёбии системаҳои репродуктивии наботот ва ҳайвонот оварда расонад, ки боиси таназзули экосистема гардад.
				<br><br>
				Чаро ин мушкилот аст:
				Тағйирёбии иқлим ба саломатӣ ва некӯаҳволии одамон таъсир расонида, боиси офатҳои табиӣ, ифлосшавӣ, тағирёбии мувозинати экологӣ ва баланси обии ҳудудҳо мегардад. Он инчунин ба иқтисодиёт таъсир мерасонад, муноқишаҳоро дар бораи захираҳо афзоиш медиҳад ва ба амнияти озуқаворӣ таҳдид мекунад.
				<br><br>

				Чӣ тавр ҳалли мушкилот:
				Барои ҳалли мушкилоти тағйирёбии иқлим, кам кардани партовҳои газҳои гулхонаӣ, гузаштан ба манбаъҳои барқароршавандаи энергия, баланд бардоштани самаранокии энергия ва мутобиқ шудан ба тағйироти аллакай рухдода зарур аст.
				<br><br>
				<a href='https://ecolomist.kz/vlijanie-izmenenija-klimata-na-jekosistemu/'>1. Влияние изменения климата на экосистему </a><br>
				<a href=' https://news.un.org/ru/story/2021/10/1411592'>2. Изменение климата влияет на здоровье и самочувствие людей</a><br>
				<a href='https://www.hse.ru/data/2024/03/01/2082500978/%D0%9F%D1%80%D0%BE%D1%81%D0%BA%D1%83%D1%80%D1%8F%D0%BA%D0%BE%D0%B2%D0%B0%20%D0%92%D0%BE%D0%B7%D0%B4%D0%B5%D0%B9%D1%81%D1%82%D0%B2%D0%B8%D0%B5_%D0%B8%D0%B7%D0%BC%D0%B5%D0%BD%D0%B5%D0%BD%D0%B8%D1%8F_%D0%BA%D0%BB%D0%B8%D0%BC%D0%B0%D1%82%D0%B0-%D0%B4%D0%BE%D0%BA%D0%BB%D0%B0%D0%B4.pdf'>3. Воздействие изменения климата на человеческий потенциал, экономику и окружающую среду</a><br>
				<a href='https://www.undp.org/ru/belarus/press-releases/izmenenie-klimata-ugroza-dlya-bioraznoobraziya-ekosistem-i-povod-splotitsya-radiprirody'>4. Изменение климата – угроза для биоразнообразия</a><br>
				<a href='https://www.un.org/ru/un75/climate-crisis-race-we-can-win'>5. Борьба с изменением климата — гонка, из которой мы не можем выйти</a><br>
				`,
				video: [
					'https://www.youtube.com/live/ZJ_ZN6kWaJ8?si=f-duwfHNMBpjmVUx',
					'https://www.youtube.com/live/nUCvXQsJ91A?si=kuW4EoEfgFgNxIf4',
				],
				test: [
					{
						question: 'Кадоме аз дарёҳои зерин дарозтарин аст?',
						answers: [
							{ id: false, test: 'Нил' },
							{ id: true, test: 'Амазонка' },
							{ id: false, test: 'Янцзы' },
							{ id: false, test: 'Миссисипи' },
						],
					},

					/*
					
					*/
					{
						question: '"Ҳалқаи оташ" чист?',
						answers: [
							{
								id: true,
								test: 'Майдони асосии хавзаи укёнуси Ором, ки дар он зилзила ва таркиши вулканхои зиёд ба амал меояд',
							},
							{ id: false, test: 'Роҳи машҳури сайёҳӣ дар Ҳавайӣ' },
							{
								id: false,
								test: 'Истилоҳе, ки барои тавсифи чароғҳои шимолӣ истифода мешавад',
							},
							{ id: false, test: 'Ташаккули геологї дар биёбони Сахара' },
						],
					},
				],
				task: `1. Таъсири плитаҳои тектоникиро ба ташаккули каторкуҳҳо омўхта, бо истифода аз Кўҳҳои Ҳимолой презентатсия тайёр кунед. <br>
				2. Шароити иқлимии ду қитъаро муқоиса кунед ва шарҳ диҳед, ки онҳо ба гуногунии биологӣ ва ҳаёти инсон чӣ гуна таъсир мерасонанд. <br>
				3. Дар бораи таъсири гармшавии глобалӣ ба шаҳрҳои соҳилӣ бо истифода аз мисолҳои кишварҳои гуногун гузориш эҷод кунед.<br>
				4. Захираҳои обии минтақаи худро таҳқиқ кунед ва нақшаи идоракунӣ ва ҳифзи онҳоро пешниҳод кунед.`,
			},
		],
	},
];

//* teacher list
export const teacher = [
	{
		id: 'math',
		teachers: [
			{
				name: 'Лангаршоева',
				id: 1,
				subject: 'литература',
				img: './img/teacher/1.jpg',
				video: 'video/1.mp4',
				practice:
					'Lorem ipsum dolor sit, amet consectetur adipisicing elit. Fugiat, atque voluptate itaque vitae possimus molestias adipisci mollitia consequuntur! Sit iusto ipsam deleniti! Rem laudantium, id atque possimus eveniet autem delectus numquam reiciendis vitae odio nostrum nobis repellat porro consequuntur nihil ducimus, magni aut quasi magnam quisquam ad? Velit quis dolor omnis voluptate veniam magni iste ea impedit. Earum veniam iure ut eius sed minima error nam nesciunt! Similique eius, officia totam adipisci sint ipsum necessitatibus, aspernatur quam iusto labore commodi modi numquam dolorem sequi enim sapiente asperiores! Blanditiis officia quaerat obcaecati laboriosam, mollitia dolore, soluta placeat expedita tempore, nostrum totam ipsum cum ut animi asperiores illum rem provident incidunt neque. Quasi sunt iste distinctio fuga voluptatibus error doloribus consequuntur, provident, blanditiis facilis repellat accusantium, tempora molestiae porro autem optio quae. Dolore corporis laborum blanditiis quisquam illum enim ipsam doloremque architecto. Corporis voluptas illo eos officiis cum laborum maiores aut quia magni necessitatibus omnis, itaque ipsum ullam quas fugit, enim beatae facere hic quasi repellendus perspiciatis architecto. Temporibus eveniet ratione nobis. Rem nam corrupti non quibusdam numquam laborum totam minus assumenda nulla? Deleniti non nostrum sapiente pariatur explicabo facilis omnis unde natus, sit assumenda quia nesciunt laudantium voluptatibus, eligendi cum facere.',
				education: 'Училась в Душанбе работает с 1991 года',
				facebook: 'https://facebook',
			},

			{
				name: 'Марина Орлова',
				id: 1,
				subject: 'Алгебра',
				img: './img/teacher/2.jpg',
				video: 'video/',
				practice:
					'Lorem ipsum dolor sit amet consectetur adipisicing elit. Temporibus, id minima amet sint illo sed?',
				education: 'Училась в Душанбе работает с 1991 года',
				facebook: 'https://facebook',
			},
		],
	},
	{
		id: 'biology',
		teachers: [
			{
				name: 'Муносибшоева Х',
				id: 1,
				subject: 'биология',
				img: './img/teacher/1.jpg',
				video: 'video/1.mp4',
				practice:
					'Lorem ipsum dolor sit, amet consectetur adipisicing elit. Fugiat, atque voluptate itaque vitae possimus molestias adipisci mollitia consequuntur! Sit iusto ipsam deleniti! Rem laudantium, id atque possimus eveniet autem delectus numquam reiciendis vitae odio nostrum nobis repellat porro consequuntur nihil ducimus, magni aut quasi magnam quisquam ad? Velit quis dolor omnis voluptate veniam magni iste ea impedit. Earum veniam iure ut eius sed minima error nam nesciunt! Similique eius, officia totam adipisci sint ipsum necessitatibus, aspernatur quam iusto labore commodi modi numquam dolorem sequi enim sapiente asperiores! Blanditiis officia quaerat obcaecati laboriosam, mollitia dolore, soluta placeat expedita tempore, nostrum totam ipsum cum ut animi asperiores illum rem provident incidunt neque. Quasi sunt iste distinctio fuga voluptatibus error doloribus consequuntur, provident, blanditiis facilis repellat accusantium, tempora molestiae porro autem optio quae. Dolore corporis laborum blanditiis quisquam illum enim ipsam doloremque architecto. Corporis voluptas illo eos officiis cum laborum maiores aut quia magni necessitatibus omnis, itaque ipsum ullam quas fugit, enim beatae facere hic quasi repellendus perspiciatis architecto. Temporibus eveniet ratione nobis. Rem nam corrupti non quibusdam numquam laborum totam minus assumenda nulla? Deleniti non nostrum sapiente pariatur explicabo facilis omnis unde natus, sit assumenda quia nesciunt laudantium voluptatibus, eligendi cum facere.',
				education: 'Училась в Душанбе работает с 1991 года',
				facebook: 'https://facebook',
			},

			{
				name: 'Марина Орлова',
				id: 1,
				subject: 'Алгебра',
				img: './img/teacher/2.jpg',
				video: 'video/',
				practice:
					'Lorem ipsum dolor sit amet consectetur adipisicing elit. Temporibus, id minima amet sint illo sed?',
				education: 'Училась в Душанбе работает с 1991 года',
				facebook: 'https://facebook',
			},
		],
	},
];
